aaron-bond.better-comments
adpyke.codesnap
aykutsarac.jsoncrack-vscode
batisteo.vscode-django
burkeholland.simple-react-snippets
charliermarsh.ruff
christian-kohler.path-intellisense
clemenspeters.format-json
dbaeumer.vscode-eslint
devzstudio.emoji-snippets
dotenv.dotenv-vscode
dsznajder.es7-react-js-snippets
eamodio.gitlens
ecmel.vscode-html-css
eddy-r.purebasic-language
enterwell.changelog-create
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
github.vscode-pull-request-github
hangxingliu.vscode-systemd-support
huibizhang.codesnap-plus
jakewilson.vscode-picture
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
l7ssha.tag-inserter
lolkush.quickstart
mechatroner.rainbow-csv
meganrogge.template-string-converter
michu.arduino-syntax-highlighter
mongodb.mongodb-vscode
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-es
ms-ossdata.vscode-postgresql
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.live-server
ms-vscode.vscode-serial-monitor
ms-vsliveshare.vsliveshare
mtxr.sqltools
mtxr.sqltools-driver-mssql
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
mtxr.sqltools-driver-sqlite
octref.vetur
pflannery.vscode-versionlens
pkief.material-icon-theme
quicktype.quicktype
qwtel.sqlite-viewer
rafamel.subtle-brackets
rangav.vscode-thunder-client
ritwickdey.liveserver
rlnt.keep-a-changelog
sidthesloth.html5-boilerplate
sirtori.indenticator
stuartelimu.django-template-snippets
twxs.cmake
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vsciot-vscode.vscode-arduino
wix.vscode-import-cost
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
